app/controllers/articles_controller.rb

  def index
    if session[:user_id] && !session[:is_admin]
        @articles = current_user.articles
    else
        @articles = Article.all
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`user_id` = 1

  def show
    @user = User.find(@article[:user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

  def new
    @article = Article.new
    @users = User.all
---
SELECT `users`.* FROM `users`

  def edit
    @users = User.all
---
SELECT `users`.* FROM `users`

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO `articles` (`title`, `post`, `user_id`, `created_at`, `updated_at`) VALUES ('Validations Overview', 'Here\'s an example of a very simple validation:', 1, '2018-04-19 07:41:55', '2018-04-19 07:41:55')