app/controllers/comments_controller.rb

	def create
		@article = Article.find(params[:article_id])

		@comment = @article.comments.create(comment_param)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`commenter`, `content`, `article_id`, `created_at`, `updated_at`) VALUES ('Manu', 'Before we dig into more details', 1, '2018-04-19 07:43:15', '2018-04-19 07:43:15')

	def destroy
		@article = Article.find(params[:article_id])
		@comment = @article.comments.find(params[:id])

		@comment.destroy()
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
SELECT  `comments`.* FROM `comments` WHERE `comments`.`article_id` = 1 AND `comments`.`id` = 10 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 10