app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`user_type` = 0 LIMIT 1
---
  def index
    @users = User.where(user_type: 0)

INSERT INTO `users` (`email`, `password_digest`, `created_at`, `updated_at`) VALUES ('manu@gmail.co', '$2a$10$L7jMXFaSMEDSw/f26oPpDurqqz.5OUzniFI2DiijH0TNm94qeHr2.', '2018-04-21 12:50:01', '2018-04-21 12:50:01')
---
  def create
    @user = User.new(user_params)
    if session[:user_id] && session[:is_admin]
      url =  users_url
    else
      url =  login_url
    end

    respond_to do |format|
      if @user.save

UPDATE `users` SET `password_digest` = '$2a$10$0XmxKnVrXqhYwE0WlkRmFuRtUo13G0UT39/W8ZCOLp.AhHVpPEbgG', `updated_at` = '2018-04-21 12:42:58' WHERE `users`.`id` = 1
---
  def update
    respond_to do |format|
      if @user.update(user_params)